###################################################################

# Created by write_sdc on Sat Apr 29 10:42:29 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports ap_clk]
set_driving_cell -lib_cell INVX1 [get_ports ap_rst_n]
set_driving_cell -lib_cell INVX1 [get_ports s_axi_AXILiteS_AWVALID]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_AWADDR[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_AWADDR[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_AWADDR[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_AWADDR[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_AWADDR[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_AWADDR[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_AWADDR[0]}]
set_driving_cell -lib_cell INVX1 [get_ports s_axi_AXILiteS_WVALID]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[31]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[30]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[29]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[28]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[27]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[26]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[25]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WDATA[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WSTRB[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WSTRB[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WSTRB[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_WSTRB[0]}]
set_driving_cell -lib_cell INVX1 [get_ports s_axi_AXILiteS_ARVALID]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_ARADDR[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_ARADDR[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_ARADDR[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_ARADDR[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_ARADDR[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_ARADDR[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {s_axi_AXILiteS_ARADDR[0]}]
set_driving_cell -lib_cell INVX1 [get_ports s_axi_AXILiteS_RREADY]
set_driving_cell -lib_cell INVX1 [get_ports s_axi_AXILiteS_BREADY]
create_clock -name vclk  -period 10  -waveform {0 5}
set_input_delay -clock vclk  0.1  [get_ports ap_clk]
set_input_delay -clock vclk  0.1  [get_ports ap_rst_n]
set_input_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_AWVALID]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_AWADDR[6]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_AWADDR[5]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_AWADDR[4]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_AWADDR[3]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_AWADDR[2]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_AWADDR[1]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_AWADDR[0]}]
set_input_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_WVALID]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[31]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[30]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[29]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[28]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[27]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[26]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[25]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[24]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[23]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[22]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[21]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[20]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[19]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[18]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[17]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[16]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[15]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[14]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[13]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[12]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[11]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[10]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[9]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[8]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[7]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[6]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[5]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[4]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[3]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[2]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[1]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WDATA[0]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WSTRB[3]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WSTRB[2]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WSTRB[1]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_WSTRB[0]}]
set_input_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_ARVALID]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_ARADDR[6]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_ARADDR[5]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_ARADDR[4]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_ARADDR[3]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_ARADDR[2]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_ARADDR[1]}]
set_input_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_ARADDR[0]}]
set_input_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_RREADY]
set_input_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_BREADY]
set_output_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_AWREADY]
set_output_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_WREADY]
set_output_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_ARREADY]
set_output_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_RVALID]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[31]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[30]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[29]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[28]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[27]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[26]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[25]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[24]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[23]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[22]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[21]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[20]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[19]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[18]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[17]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[16]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[15]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[14]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[13]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[12]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[11]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[10]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[9]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[8]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[7]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[6]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[5]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[4]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[3]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[2]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[1]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RDATA[0]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RRESP[1]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_RRESP[0]}]
set_output_delay -clock vclk  0.1  [get_ports s_axi_AXILiteS_BVALID]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_BRESP[1]}]
set_output_delay -clock vclk  0.1  [get_ports {s_axi_AXILiteS_BRESP[0]}]
set_output_delay -clock vclk  0.1  [get_ports interrupt]
